In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({"NA": [0,1,0,1,0,1], "Label": ["TN", "GA", "TN", "MN", "CA","CA"]})

In [7]:
df.head(5)

   NA Label
0   0    TN
1   1    GA
2   0    TN
3   1    MN
4   0    CA

In [13]:
ones_only = df["NA"] == 1

In [14]:
df[ones_only]

   NA Label
1   1    GA
3   1    MN
5   1    CA

In [16]:
df = pd.DataFrame({"Store ID": [1,8,7,4,11,2], "Income": [-12, 56, -2, 23, 7, 16]})

In [17]:
df.head()

   Store ID  Income
0         1     -12
1         8      56
2         7      -2
3         4      23
4        11       7

In [20]:
def negatives(input):
  color = 'red' if input < 0 else 'black'
  return 'color: %s' % color

In [21]:
df.style.applymap(negatives)

In [22]:
df = pd.DataFrame({"Group A": [7,9,11,12,16], "Group B": [12,14, 3, 7, 2]})

In [23]:
df.head(5)

   Group A  Group B
0        7       12
1        9       14
2       11        3
3       12        7
4       16        2

In [24]:
df['total']     = df.apply(lambda x: x.sum(), axis=1)

In [25]:
df.head()

   Group A  Group B  total
0        7       12     19
1        9       14     23
2       11        3     14
3       12        7     19
4       16        2     18

In [30]:
cross = pd.crosstab(index = df["Group A"], columns = df["Group B"])

In [36]:
cross.head()

Group B  2   3   7   12  14
Group A
7         0   0   0   1   0
9         0   0   0   0   1
11        0   1   0   0   0
12        0   0   1   0   0
16        1   0   0   0   0

In [33]:
def load_config():
    options = {
        'display': {
            'max_columns': None,
            'max_colwidth': 25,
            'expand_frame_repr': False, 
            'max_rows': 14,
            'max_seq_items': 50,      
            'precision': 4,
            'show_dimensions': False
        },
        'mode': {
            'chained_assignment': None 
        }
    }

    for category, option in options.items():
        for op, value in option.items():
            pd.set_option(f'{category}.{op}', value)

In [34]:
pd.Series._accessors

{'cat', 'dt', 'sparse', 'str'}

In [35]:
load_config()

In [39]:
locations = pd.Series([
     'Cleveland, TN 37311',
     'Brooklyn, NY 11211-1755',
    'East Moline, IL 61275',
    'Pittsburgh, PA 15211'
 ])

In [40]:
locations.str.count(r'\d')

0    5
1    9
2    5
3    5
dtype: int64